tocache/Microchip-PIC18F57Q43/ELEC225 2024-1 Examples/Sem05_7MUX_TMR0_INT.X/maincode2.c
#include <xc.h>
#include "cabecera.h"
#define _XTAL_FREQ 4000000UL

//unsigned char mensaje[] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x73, 0x38, 0x3E, 0x15, 0x3F, 0x54, 0x00, 0x00, 0x00, 0x00, 0x00};
unsigned char mensaje[] = {"      PLUMON     "};
//0x55,0x50,0x41,0x4F en ascii
	                     //A    B    C    D    E    F    G    H    I    J    K    L    M    N    O    P    Q    R    S    T    U    V    W    X    Y    Z  
unsigned char decod[] = {0x77,0x7C,0x39,0x5E,0x79,0x71,0x6F,0x74,0x30,0x1E,0x76,0x38,0x15,0x54,0x3F,0x73,0x67,0x50,0x6D,0x78,0x3E,0x1C,0x2A,0x76,0x6E,0x5B};
unsigned char indice = 0;

void configuro(void){
    OSCCON1 = 0x60;         //HFINTOSC, DIV 1:1
    OSCFRQ = 0x02;          //HFINTOSC a 4MHz
    OSCEN = 0x40;           //HFINTOSC enabled
    TRISD = 0x00;           //RD outputs
    ANSELD = 0x00;          //RD digital
    TRISB = 0xC0;           //RB5:RB0 outputs
    ANSELB = 0xC0;          //RB5:RB0 digital
    ANSELE = 0xFC;          //RE1:RE0 digital
    WPUE = 0x03;            //RE1:RE0 weak pullup enabled
    T0CON0 = 0x97;          //TMR0 enabled, 16 bits mode, 1:8 postscaler
    T0CON1 = 0x40;          //FOSC/4 clock src, 1:1 prescaler
    PIE3bits.TMR0IE = 1;    //TMR0 interrupt enabled
    INTCON0bits.GIE = 1;    //Global interrupt enabled
    LATB = 0;               //condicion inicial
}

void main(void) {
    configuro();
    while(1){
        LATD = decod[mensaje[indice]-0x41];
        LATBbits.LATB0 = 1;
        __delay_ms(2);
        LATBbits.LATB0 = 0;
        LATD = decod[mensaje[indice]-0x41];
        LATBbits.LATB1 = 1;
        __delay_ms(2);
        LATBbits.LATB1 = 0;
        LATD = decod[mensaje[indice]-0x41];
        LATBbits.LATB2 = 1;
        __delay_ms(2);
        LATBbits.LATB2 = 0;
        LATD = decod[mensaje[indice]-0x41];
        LATBbits.LATB3 = 1;
        __delay_ms(2);
        LATBbits.LATB3 = 0;
        LATD = decod[mensaje[indice]-0x41];
        LATBbits.LATB4 = 1;
        __delay_ms(2);
        LATBbits.LATB4 = 0;
        LATD = decod[mensaje[indice]-0x41];
        LATBbits.LATB5 = 1;
        __delay_ms(2);
        LATBbits.LATB5 = 0;
    }
}

void __interrupt(irq(IRQ_TMR0)) TMR0_ISR(void){
    PIR3bits.TMR0IF = 0;
    if(indice == 11){
        indice = 0;
    }
    else{
        indice++;
    }
}